app/controllers/locations_controller.rb

SELECT "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
        location_id = params[:id]
        @location = Location.find location_id