app/views/locations/show.html.erb

SELECT "characters".* FROM "characters" WHERE "characters"."location_id" = ?  [["location_id", 8]]
---

    <% @location.characters.each do |character| %>